const $=`# 第二章 随机变量及其分布\r
\r
## 随机变量定义\r
\r
$(\\Omega,F,P)$是一个概率空间，$\\xi (\\omega)$是定义在样本空间$\\Omega$内的一个单值函数，如果对任意**实数 $x$**，有$$\\left\\\\{\\omega: \\xi(\\omega)≤x\\right\\\\} \\in F$$则称$\\xi(\\omega)$为**随机变量**，记作$\\xi$。\r
\r
> $\\xi(\\omega)$是一个函数，$\\omega$为自变量，定义域为$\\Omega$。\r
\r
## 分布函数定义\r
\r
设$\\xi(\\omega)$为随机变量，对于任意实数$x$，记$F(x)=P\\left\\\\{\\xi(\\omega)≤x\\right\\\\}$，$(-\\infty < x<+\\infty)$  \r
称$F(x)$为随机变量$\\xi(\\omega)$的分布函数。\r
\r
## 分布函数性质\r
\r
1. $F(x)$单调不减函数，即对任意实数$x_1,x_2$且$x_1 < x_2$，有$F(x_1)≤F(x_2)$ \r
\r
2. $0≤F(x)≤1$，且$$F(-\\infty)=\\lim_{x \\to -\\infty}F(x)=0,\\quad F(+\\infty)=\\lim_{x \\to +\\infty} F(x)=1$$\r
3. $F(x)=F(x+0)$，即$F(x)$是**右连续**\r
4. 对于任意实数$x_1,x_2$，且$x_1 < x_2$，有$$P\\left \\\\{x_1 <X≤ x_2 \\right \\\\}=F(x_2)-F(x_1)$$\r
5. 对任意的$x$,有$$P\\left \\\\{X=x\\right \\\\} = F(x)-F(x-0)$$\r
\r
> 特别地，如果 X 是连续性随机变量，则有\r
> $$\r
P\\left \\\\{a<X≤b\\right \\\\}=P\\left \\\\{a≤X<b\\right \\\\}=P\\left \\\\{a<X<b\\right \\\\}=\r
P\\left \\\\{a≤X≤b\\right \\\\}=F(b)-F(a)\r
$$\r
\r
## 离散型随机变量\r
\r
### 定义\r
\r
设$X$是一个随机变量，如果$X$的取值是有限个或无穷可列个值，则称$X$为**离散型随机变量**。  \r
设离散型随机变量$X$所有可能取的值为$x_i(i=1,2,\\cdots)$，$X$取各个可能值的概率(即事件$ \\left \\\\{X=x_i\\right\\\\}$的概率)$P\\left\\\\{X=x_i\\right\\\\}$为$p_i(i=1,2,\\cdots)$，则称$P\\left\\\\{X=x_i\\right\\\\}=p_i(i=1,2,\\cdots)$为$X$的**概率分布**或**分布律**.\r
\r
也可采用表格形式表示，即\r
\r
- <table>\r
    <tr>\r
      <th>$X$</th>\r
      <th>$x_1\\ \\ \\  x_2\\ \\ \\  \\cdots\\ \\ \\ x_n \\ \\ \\ \\cdots$</th>\r
    </tr>\r
    <tr>\r
      <td>$p_i$</td>\r
      <td>$p_1\\ \\ \\  p_2\\ \\ \\  \\cdots\\ \\ \\ p_n \\ \\ \\ \\cdots$</td>\r
    </tr>\r
  </table>\r
\r
或\r
\r
- $\r
X \\sim\r
\\begin{equation}\r
 \\left(\r
 \\begin{array}{ccc}\r
    &x_1\\ \\ \\  &x_2\\ \\ \\  &\\cdots\\ \\ \\ &x_n\\ \\ \\  \\cdots\\ \\ \\  \\\\\\\\\\\\\r
   &p_1\\ \\ \\  &p_2\\ \\ \\  &\\cdots\\ \\ \\ &p_n\\ \\ \\  \\cdots\\ \\ \\ \r
 \\end{array}\r
 \\right)\r
 \\end{equation}\r
$\r
\r
对于任意实数$a<b$，有\r
\r
$$\r
P\\left \\\\{a≤X≤b\\right \\\\}=\\sum_{a≤x_i≤b}P\\left \\\\{X=x_i\\right \\\\}=\\sum_i p_i.\r
$$\r
\r
其中$\\sum$表示对于满足$a≤x_i≤b$的一切$\\left \\\\{X=x_i\\right\\\\}$发生的概率求和.\r
\r
## 离散型随机变量的概率分布的性质\r
\r
1. $p_i≥0,i=1,2,\\cdots$ \r
\r
2. $$\\sum_ip_i=1\\hspace{100cm}$$\r
\r
## 离散型随机变量$X$的分布函数\r
\r
设离散型随机变量 X 的概率分布为$p_i=P\\left \\\\{X=x_i\\right\\\\}$，则$X$的分布函数为\r
\r
$$\r
F(x)=P\\left \\\\{X≤x\\right\\\\}=\\sum_{x_i≤x}P\\left \\\\{X=x_i\\right\\\\}\\ (-\\infty<x<+\\infty).\r
$$\r
\r
其中$\\sum$表示对于满足$x_i≤x$的一切$\\left \\\\{X=x_i\\right\\\\}$发生的概率求和.$F(x)$在$(-\\infty,+\\infty)$内除$X$可能取的值$x_i(i=1,2,\\cdots)$外，处处是连续的.\r
\r
## 连续性随机变量\r
\r
### 连续性随机变量及其概率密度\r
\r
设随机变量$X$的分布函数为$F(x)$，如果存在非负可积函数$f(x)$，使得对于任意实数$x$，有\r
\r
$$\r
F(x)=P\\left \\\\{X≤x\\right\\\\}=\\int_{-\\infty}^xf(t)dt.\r
$$\r
\r
则称$X$为**连续型随机变量**，$f(x)$为$X$的**概率密度函数**，简称**概率密度**.\r
\r
### 连续性随机变量的概率密度$f(x)$的性质\r
\r
1. $f(x)≥0$  \r
\r
2. $\\int_{-\\infty}^{+\\infty}f(x)dx=1$ \r
\r
3. 对于任意实数$x_1,x_2(x_1≤x_2)$，有\r
   $$\r
   P\\left \\\\{x_1≤X≤x_2\\right\\\\}=F(x_2)-F(x_1)=\\int_{x_1}^{x_2}f(t)dt.\r
   $$\r
\r
4. 若$f(x)$在点$x$处连续，则有$F'(x)=f(x)$.\r
\r
此外，任意连续型随机变量$X$取任意给定的值$c$的概率等于$0$，即$P\\left \\\\{X=c\\right \\\\}=0$.\r
\r
> [注] \r
>\r
> 1. 性质1，2是函数$f(x)$为某一随机变量$X$的概率密度的**充要条件**.\r
>\r
> 2. 给定$X$的概率密度$f(x)$就能确定$F(x)$，由于$f(x)$位于积分号之内，故改变$f(x)$在这个区间内有限个点的函数值，并不改变$X$在该区间内取值的概率.\r
> 3. 由于连续型随机变量$X$的分布函数$F(x)$必可表示成$F(x)=\\int_{-\\infty}^x f(t)dt$，故此时的$F(x)$一定是$(-\\infty,+\\infty)$上的连续函数。反之，不能说凡是连续的$F(x)$对应的$X$就一定是连续性随机变量.\r
> 4. 连续型随机变量$X$的分布函数$F(x)$必连续，但密度函数$f(x)$不一定连续. \r
\r
## 常见的离散型、连续性随机变量及其概率分布 \r
\r
### 常见的离散型随机变量及其概率分布 \r
\r
#### 0-1分布 \r
\r
如果随机变量$X$只可能取$0$与$1$两个值，其概率分布\r
\r
$$\r
P\\left \\\\{X=k\\right\\\\}=p^kq^{1-k}\\quad(k=0,1).\r
$$\r
\r
则称$X$服从参数为$p(0<p<1)$的**0-1分布**或**两点分布**，其中$q=1-p$.\r
> [注]\r
> 1. 该分布用来描述只有两种对立结果(成果与失败、合格与不合格、击中与未击中等)的伯努利试验.\r
> \r
> 2. 以后当我提到一个随机变量$X$的"概率分布"时，指的是它的分布函数；或者，当$X$是连续型随机变量时，指的是它的概率密度，当$X$是离散型随机变量时，指的是它的分布律.\r
\r
### 二项分布 \r
\r
如果随机变量的概率分布为 \r
\r
$$\r
P\\left \\\\{X=k\\right\\\\}=C_n^kp^kq^{n-k}\\quad(k=0,1,2,\\cdots,n).\r
$$\r
\r
则称$X$服从参数为$n,p$的**二项分布**，记作$X\\sim B(n,p)$，其中$0<p<1,q=1-p$. \r
\r
> [注] \r
> 1. 二项分布描述的是$n$重伯努利试验，若每次试验成功率为$p(0<p<1)$，进行$n$次独立重复试验，则成功总次数$X$服从**二项分布**.或若$X$是$n$重伯努利试验中事件$A$发生的次数，则$X \\sim B(n,p)$，其中$p=P(A)$.\r
> \r
> 2. 如果$X$服从二项分布 `;export{$ as default};
