const r=`**解：** \r
\r
设$A_i$表示事件“在第一次比赛时取出的 2 个球中有 $i$ 个是新球,其余是用过的球”$(i=0.1.2)$,$B$ 表示事件“在第二次比赛时取出的球全是新球”,则有\r
$$P(A_0)=\\frac{C_2^2}{C_{10}^2}=\\frac{1}{45},\\quad P(B|A_0)=\\frac{C_8^3}{C_{10}^3}=\\frac{7}{15}$$\r
$$P(A_1)=\\frac{C_2^1C_8^1}{C_{10}^2}=\\frac{16}{45},\\quad P(B|A_1)=\\frac{C_7^3}{C_{10}^3}=\\frac{7}{24}$$\r
$$P(A_2)=\\frac{C_8^2}{C_{10}^2}=\\frac{28}{45},\\quad P(B|A_2)=\\frac{C_6^3}{C_{10}^3}=\\frac{1}{6}.$$\r
由于$A_0,A_1,A_2$构成完备事件组，由全概率公式得\r
$$P(B)=\\sum_{i=0}^2 P(A_i)P(B|A_i)=\\frac{1}{45} \\cdot \\frac{7}{15}+\\frac{16}{45} \\cdot \\frac{7}{24}+\\frac{28}{45} \\cdot \\frac{1}{6}=\\frac{49}{225} \\approx 0.218.$$`;export{r as default};
